# CannotCutParallelToLocationCurve Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SlantedColumnFailures..::..CannotCutParallelToLocationCurve Property
BuiltInFailures..::..SlantedColumnFailures Class See Also
---
Cut plane of slanted column end is parallel to the location curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCutParallelToLocationCurve { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCutParallelToLocationCurve As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCutParallelToLocationCurve {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SlantedColumnFailures Class
Autodesk.Revit.DB Namespace